---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelHermiteSpline
source: html/b04c687f-b78e-bcac-ffa9-82a9123555f0.htm
---
# ModelHermiteSpline Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.